<?php

namespace Faker\Provider\bn_BD;

class Address extends \Faker\Provider\Address
{
    protected static $cityPrefix = array('দক্ষিন', 'পূর্ব', 'পশ্চিম', 'উত্তর', 'নতুন', 'পুরাতন', 'লেইক', 'পোর্ট');
    protected static $citySuffix = array('টাউন', 'তলা', 'হাট', 'খানা', 'শহর', 'উদ্যান', 'পর্বত', 'ভূমি', 'মধ্য', 'সার্কেল', 'বাগ', 'বাগান', 'পুর', 'বাজার', 'গঞ্জ', 'ডাঙ্গা', 'ছড়ি', 'গ্রাম');

    protected static $streetNames = array(
        'বরকত', 'হাজী', 'করিমউদ্দিন', 'আম', 'মালী', 'লিচু', 'কলা'
    );

    protected static $streetSuffix = array(
        'তলী', 'গলি', 'চিপা', 'ব্রীজ', 'সড়ক', 'বাইপাস', 'ক্যাম্প', 'বাজার', 'তলা', 'হাট'
    );
    protected static $postcode = array('#####', '#####-####');
    protected static $state = array(
        'ঢাকা', 'ফরিদপুর', 'গাজীপুর', 'গোপালগঞ্জ', 'জামালপুর ', 'কিশোরগঞ্জ', 'মাদারীপুর', 'মানিকগঞ্জ', 'মুন্সিগঞ্জ', 'ময়মনসিংহ', 'নারায়ণগঞ্জ', 'নরসিংদী', 'নেত্রকোনা', 'রাজবাড়ী', 'শরিয়তপুর', 'শেরপুর', 'টাঙ্গাইল',
        'খুলনা', 'বাগেরহাট', 'চুয়াডাঙ্গা', 'যশোর', 'ঝিনাইদহ', 'কুষ্টিয়া', 'মাগুরা', 'মেহেরপুর', 'নড়াইল', 'সাতক্ষীরা',
        'চট্টগ্রাম', 'বান্দরবান', 'ব্রাহ্মণবাড়ীয়া', 'চাঁদপুর', 'কুমিল্লা', 'কক্সবাজার', 'ফেনী', 'খাগড়াছড়ি', 'লক্ষ্মীপুর', 'নোয়াখালী', 'রাঙামাটি',
        'বরিশাল', 'বরগুনা', 'ভোলা', 'ঝালকাঠি', 'পটুয়াখালী', 'পিরোজপুর',
        'রাজশাহী', 'বগুড়া', 'জয়পুরহাট', 'নওগাঁ', 'নাটোর', 'নবাবগঞ্জ', 'পাবনা', 'সিরাজগঞ্জ',
        'সিলেট', 'হবিগঞ্জ', 'মৌলভীবাজার', 'সুনামগঞ্জ',
        'রংপুর', 'দিনাজপুর', 'গাইবান্ধা', 'কুড়িগ্রাম', 'নীলফামারী', 'পঞ্চগড়', 'ঠাকুরগাঁও', 'লালমনিরহাট'
    );
    protected static $country = array(
        'আফগানিস্তান', 'আলবেনিয়া', 'আলজেরিয়া', 'আমেরিকান সামোয়া', 'অ্যান্ডোরা', 'অ্যাঙ্গোলা', 'এ্যাঙ্গুইলা', 'এন্টিগুয়া ও বারবুডা', 'আর্জেন্টিনা', 'আর্মেনিয়া', ' আরুবা', 'অস্ট্রেলিয়া', 'অস্ট্রিয়া', 'আজারবাইজান',
        'বাহামা দ্বীপপুঞ্জ', 'বাহরাইন', 'বাংলাদেশ', 'বার্বাডোস', 'বেলারুশ', 'বেলজিয়াম', 'বেলিজ', 'বেনিন', 'বারমুডা', 'ভুটান', 'বলিভিয়া', 'বসনিয়া ও হার্জেগোভিনা', 'বতসোয়ানা', 'ব্রাজিল', 'ব্রিটিশ ভার্জিন দ্বীপপুঞ্জ', 'ব্রুনাই', 'বুলগেরিয়া', 'বুর্কিনা ফাসো', 'বুরুন্ডি',
        'কম্বোডিয়া', 'ক্যামেরুন', 'কানাডা', 'কেপ ভার্দ', 'কেইম্যান দ্বীপপুঞ্জ', 'মধ্য আফ্রিকান প্রজাতন্ত্র', 'চাদ', 'চিলি', 'গণচীন', 'চীনা তাইপেই', 'কলম্বিয়া', 'কোমোরোস', 'কঙ্গো', 'গণতান্ত্রিক কঙ্গো প্রজাতন্ত্র', 'কুক দ্বীপপুঞ্জ', 'কোস্টা রিকা', 'আইভরি কোস্ট', 'ক্রোয়েশিয়া', 'কিউবা', 'কুরাকাও দ্বীপ', 'সাইপ্রাস', 'চেক প্রজাতন্ত্র',
        'ডেনমার্ক', 'জিবুতি', 'ডোমিনিকা', 'ডোমিনিকান প্রজাতন্ত্র',
        'ইকুয়েডর', 'মিশর', 'ইংল্যান্ড', 'বিষুবীয় গিনি', 'ইরিত্রিয়া', 'ইস্তোনিয়া', 'ইথিওপিয়া',
        'ফারো দ্বীপপুঞ্জ', 'ফিজি', 'ফিনল্যান্ড', 'ফ্রান্স',
        'গাবন', 'গাম্বিয়া', 'জর্জিয়া', 'জার্মানি', 'ঘানা', 'গ্রিস', 'গ্রানাডা', 'গুয়াম', 'গুয়াতেমালা', 'গিনি', 'গিনি-বিসাউ', 'গায়ানা',
        'হাইতি', 'হন্ডুরাস', 'হংকং', 'হাঙ্গেরি',
        'আইসল্যান্ড', 'ভারত', 'ইন্দোনেশিয়া', 'ইরান', 'ইরাক', 'ইসরায়েল', 'ইতালি', 'জামাইকা', 'জাপান', 'জর্দান', 'প্রজাতন্ত্রী আয়ারল্যান্ড	',
        'কাজাখস্তান', 'কেনিয়া', 'উত্তর কোরিয়া', ' দক্ষিণ কোরিয়া', 'কুয়েত', 'কিরগিজিস্তান',
        'লাওস', 'লাতভিয়া', 'লেবানন', 'লেসোথো', 'লাইবেরিয়া', 'লিবিয়া', 'লিশটেনস্টাইন', 'লিথুয়ানিয়া', 'লুক্সেমবুর্গ',
        'মাকাও', 'ম্যাসেডোনিয়া', 'মাদাগাস্কার', 'মালাউই', 'মালয়েশিয়া', 'মালদ্বীপ', 'মালি', 'মাল্টা', 'মৌরিতানিয়া', ' মরিশাস', 'মেক্সিকো', 'মলদোভা', 'মঙ্গোলিয়া', 'মন্টিনিগ্রো', 'মন্টসেরাট', 'মরোক্কো', 'মোজাম্বিক', 'মায়ানমার',
        'নামিবিয়া', 'নেপাল', 'নেদারল্যান্ডস', 'নিউ ক্যালিডোনিয়া', 'নিউজিল্যান্ড', 'নিকারাগুয়া', 'নাইজার', 'নাইজেরিয়া', 'উত্তর আয়ারল্যান্ড', 'নরওয়ে',
        'ওমান',
        'পাকিস্তান', 'ফিলিস্তিন', 'পানামা', 'পাপুয়া নিউ গিনি', 'প্যারাগুয়ে', 'পেরু', 'ফিলিপাইন', 'পোল্যান্ড', 'পর্তুগাল', 'পুয়ের্তো রিকো',
        'কাতার',
        'রোমানিয়া', 'রাশিয়া', 'রুয়ান্ডা',
        'সেন্ট কিট্‌স ও নেভিস', 'সেন্ট লুসিয়া', 'সেন্ট ভিনসেন্ট ও গ্রেনাডাইন দ্বীপপুঞ্জ', 'সামোয়া', 'সান মারিনো', 'সাঁউ তুমি ও প্রিন্সিপি', 'সৌদি আরব', 'স্কটল্যান্ড', 'সেনেগাল', 'সার্বিয়া', 'সেশেল', 'সিয়েরা লিওন', 'সিঙ্গাপুর', 'স্লোভাকিয়া', 'স্লোভেনিয়া', 'সলোমন দ্বীপপুঞ্জ', 'সোমালিয়া', 'দক্ষিণ আফ্রিকা', 'স্পেন', 'শ্রীলঙ্কা', 'সুদান', 'দক্ষিণ সুদান', 'সুরিনাম', 'সোয়াজিল্যান্ড', 'সুইডেন', 'সুইজারল্যান্ড', 'সিরিয়া',
        'তাহিতি', 'তাজিকিস্তান', 'তানজানিয়া', 'থাইল্যান্ড', 'টিমোর-লেস্ট ', 'টোগো', 'টোঙ্গা', 'ত্রিনিদাদ ও টোবাগো', 'তিউনিসিয়া', 'তুরস্ক', 'তুর্কমেনিস্তান', ' টার্কস্‌ ও কেইকোস দ্বীপপুঞ্জ',
        'উগান্ডা', 'ইউক্রেন', 'সংযুক্ত আরব আমিরাত', 'মার্কিন যুক্তরাষ্ট্র', 'উরুগুয়ে', 'উজবেকিস্তান',
        'মার্কিন ভার্জিন দ্বীপপুঞ্জ', 'ভানুয়াটু', 'ভেনেজুয়েলা', 'ভিয়েতনাম',
        'ওয়েল্‌স্‌',
        'ইয়েমেন',
        'জাম্বিয়া', 'জিম্বাবুয়ে'
    );
    protected static $cityFormats = array(
        '{{cityPrefix}}{{citySuffix}}',

    );
    protected static $streetNameFormats = array(
        '{{banglaStreetName}} {{streetSuffix}}',

    );
    protected static $streetAddressFormats = array(
        '{{streetNumber}} {{streetName}}',
    );
    protected static $addressFormats = array(
        "{{streetAddress}}, {{city}} {{state}}",
    );

    /**
     * @return string
     */
    public static function cityPrefix()
    {
        return static::randomElement(static::$cityPrefix);
    }

    /**
     * @return string
     */
    public static function state()
    {
        return static::randomElement(static::$state);
    }

    /**
     * @return string
     */
    public static function streetNumber()
    {
        return Utils::getBanglaNumber(static::randomNumber(1, 100));
    }

    /**
     * @return string
     */
    public static function banglaStreetName()
    {
        return static::randomElement(static::$streetNames);
    }
}
